export const imagesAndDescriptions = [
  {
      iljuString: "갑자",
      name: "갑자(甲子)",
      image: "/imgs/갑자.png",
      hashtags: "#기상 #생명력 #인내 #포용력",
      description: "갑자일주는 밝고 명랑한 성향과 강한 생명력을 지니며, 시작에 대한 기상이 있습니다. \n또한, 인내와 노력을 기울이는 특성이 있으며, 세상의 질서에 새로운 이상을 부여하려고 합니다. 갑자일주의 인간관계에서는 남녀 공히 포용력이 넓고, 많은 사람들이 술을 좋아하는 경향이 있습니다."
  },
  {
    iljuString: "을축",
    name: "을축(乙丑)",
    image: "/imgs/을축.png",
    hashtags: "#온순함 #강인한정신 #현실성 #인간관계",
    description: "을축일주는 온순하면서도 속에 강인한 주관과 고집을 가진 사람들이 많습니다. 그들은 강인한 정신적 체력을 지니며, 처음보다는 끝이 더 좋은 경향을 보입니다. \n그러나 과도한 현실성으로 인해 때로 다른 사람들에게 차가운 이미지를 줄 수 있으며, 본인의 이익을 위한 행동은 지양해야 합니다."
  },
  {
    iljuString: "병인",
    name: "병인(丙寅)",
    image: "/imgs/병인.png",
    hashtags: "#밝은성격 #리더십 #성급함 #편견없음",
    description: "병인일주는 밝고 화려한 성격을 지녔으며, 강력한 양의 기운과 함께 성급한 성향을 보입니다. 그들은 리더십이 뛰어나 원대한 포부를 갖고 있지만, 동시에 성공과 실패를 반복하는 인생을 가질 수 있습니다. \n그들은 주변에 항상 사람이 많으며, 편견 없이 누구에게나 친절하게 대하며, 주위의 사람들로부터 많은 관심을 받습니다."
  },
  {
    iljuString: "정묘",
    name: "정묘(丁卯)",
    image: "/imgs/정묘.png",
    hashtags: "#융통성 #다재다능 #동정심 #변덕스러움",
    description: "정묘일주는 융통성과 발표력을 지니면서 명랑하고 밝은 성격을 갖추고 있습니다. 다재다능한 성향과 빠른 상황 판단 능력, 센스와 스타일에 있어 뛰어난 경향이 있지만, 변덕스럽고 결정에 어려움을 겪는 특징도 보입니다. \n주변 사람들과의 관계에서는 동정심을 잘 발휘하지만, 때로는 지나치게 주는 경향이 있어 사람들이 부담을 느낄 수 있습니다."
  },
  {
    iljuString: "무진",
    name: "무진(戊辰)",
    image: "/imgs/무진.png",
    hashtags: "#완벽주의 #리더쉽 #성숙성 #경쟁력",
    description: "무진일주는 힘과 완벽주의가 특징이며, 스스로 부족함이 없다고 느낍니다. 리더로서의 위치에서는 높은 기준과 가혹한 면모를 보이기도 하지만, 초년의 고생을 겪은 무진일주는 성숙하고 책임감 있는 성격을 갖게 됩니다. \n예의와 경쟁력을 동시에 갖추고 있어, 상대와의 기준 차이에 유의해야 합니다."
  },
  {
    iljuString: "기사",
    name: "기사(己巳)",
    image: "/imgs/기사.png",
    hashtags: "#추진력 #학문 #끈질김 #다면성",
    description: "기사일주는 세월이 흐를수록 성공이 있으며, 노력과 인내심이 뛰어난 유형입니다. 겉과 속이 다르며, 승부욕과 추진력이 강하지만 때로는 고집으로 나타납니다. \n학문과 깊은 견문을 추구하며, 끈질기게 목표를 향해 전진하는 성격을 가지고 있습니다."
  },
  {
    iljuString: "경오",
    name: "경오(庚午)",
    image: "/imgs/경오.png",
    hashtags: "#유머감각 #반듯한성격 #사교적인활동",
    description: "경오일주는 원만한 처세와 자존심을 바탕으로 어려운 상황을 극복하는 성격을 지녔으며, 마음이 넓고 쾌활한 사람이 많습니다. 그러나 인기가 많고 반듯한 성향 때문에 종종 시기와 질투를 받는 경향이 있습니다. \n경오일주는 자신의 영역에 대한 확고한 선과 의지를 지니고, 옳은 길과 바른 길을 추구하는 강한 의지를 가지고 있습니다."
  },
  {
    iljuString: "신미",
    name: "신미(辛未)",
    image: "/imgs/신미.png",
    hashtags: "#외유내강 #분석력 #사회적능력 #신앙학문",
    description: "신미일주는 외유내강의 특성을 지녔으며, 분석력이 뛰어나나 지나치게 냉정할 때가 있습니다. \n사회적 능력이 활발하며, 세상을 잘 관찰하고 사람들의 눈치를 잘 본다는 특징이 있습니다. 또한, 신미일주의 사람은 신앙이나 학문에 깊은 관심을 갖는 경향이 있습니다."
  },
  {
    iljuString: "임신",
    name: "임신(壬申)",
    image: "/imgs/임신.png",
    hashtags: "#완벽주의 #문화예술 #능수능란 #대인관계",
    description: "임신일주의 사람들은 문화와 예술 분야에서 뛰어난 재능을 지니며, 폭넓은 지식과 다방면의 재주를 갖추고 있습니다. 그러나 너무 많은 관심사 때문에 한 분야에서 빠르게 성공하기는 어려울 수 있습니다. \n대인관계에서 능수능란하게 행동하지만, 때로는 자신의 속내를 표현하지 않아 고독한 경향도 나타납니다."
  },
  {
    iljuString: "계유",
    name: "계유(癸酉)",
    image: "/imgs/계유.png",
    hashtags: "#화려함 #여림 #기억력 #효율성",
    description: "계유일주는 겉으로 화려하지만 내면은 여린 성향을 지니고 있으며, 그러한 화려함과 여림으로 인해 많은 사람들의 관심을 받습니다. 이들은 깊은 기억력과 암기력을 갖추었으며, 효율성과 가성비가 좋아 조금의 배움으로 큰 성과를 낼 수 있습니다. \n그러나 자신의 재주에 과신하여 여러 일에 손을 대다가 실패하는 경우도 있습니다."
  },
  {
    iljuString: "갑술",
    name: "갑술(甲戌)",
    image: "/imgs/갑술.png",
    hashtags: "#원만한성품 #말재주 #재물인연 #자기계발",
    description: "갑술일주는 초봄과 늦가을의 기운이 혼합되어 있어, 결실의 조건이 잘 갖춰져 있다고 볼 수 있습니다. 이 일주의 특징은 원만한 성품과 재물에 대한 깊은 인연, 그리고 타고난 말재주를 지니고 있다는 것입니다. \n그러나 때로는 자신의 장점을 과도하게 드러내면서 남을 원망하는 경향이 있으므로 조심스러운 대처가 필요하다고 볼 수 있습니다."
  },
  {
    iljuString: "을해",
    name: "을해(乙亥)",
    image: "/imgs/을해.png",
    hashtags: "#침착성 #인간적성향 #끈기 #외유내강",
    description: "을해일주는 명랑한 기운과 함께 침착하고 인간적인 성향을 갖추었습니다. 이 일주는 강한 내면의 힘을 갖추고 있어, 겉으로는 온유하지만 속은 격렬한 모순을 가지고 있습니다. \n인내심과 끈기가 강해 오랜 노력과 몰두를 통해 큰 결심을 가지고 일을 추진하는 경향이 있습니다."
  },
  {
    iljuString: "병자",
    name: "병자(丙子)",
    image: "/imgs/병자.png",
    hashtags: "#천성 #기분파 #지속성 #자존심",
    description: "병자일주는 세상을 밝히는 지도자의 성격을 가지며, 천간과 지지의 극단적인 에너지가 만나 엄청난 에너지를 발휘합니다. 이 에너지는 종종 기분파로 나타나며, 그러나 아이러니하게도 지속성과 순수함을 가진 성격을 표현합니다. \n병자일주의 천성은 인자하고 고결하며, 그들 사이에는 강한 결속력과 가족애, 그리고 높은 자존심과 단정함이 있습니다."
  },
  {
    iljuString: "정축",
    name: "정축(丁丑)",
    image: "/imgs/정축.png",
    hashtags: "#침착한외면 #활동성 #지혜로움 #따뜻함",
    description: "정축일주는 침착하고 편안한 외면을 보이나 내면에서는 활동성과 강한 욕구가 흐릅니다. 성격이 급하고 예민하며, 외롭고 고독한 감정이 자주 따라다니는 특징을 가지고 있습니다. \n그럼에도 불구하고 지혜롭고 따뜻한 성격을 지니며, 주변 사람들에게 잘하려는 경향이 있습니다."
  },
  {
    iljuString: "무인",
    name: "무인(戊寅)",
    image: "/imgs/무인.png",
    hashtags: "#활발한에너지 #사회성 #다양한교류 #활동적",
    description: "무인일주는 그들의 활발한 에너지와 사회성으로 주변을 밝게 만듭니다. 그들은 타인과의 소통을 중요시하며, 다양한 사람들과의 교류를 즐깁니다. \n그러나 지나친 활동성으로 인해 여유를 갖지 못하는 경우가 있습니다."
  },
  {
    iljuString: "기묘",
    name: "기묘(己卯)",
    image: "/imgs/기묘.png",
    hashtags: "#지도적 #안정적에너지 #만물생산 #가족우선",
    description: "기묘일주는 만물을 포용하고 생산하는 성격을 지녔으며, 조용하면서도 지도적인 입장을 취하는 것을 선호합니다. 그 특성 상 안정적인 에너지를 발산하면서도 가족을 중심으로 생각하는 가족 우선주의의 성향을 보입니다. \n그러나 때로는 끈기가 부족하여 일을 오래 집중하거나 이어가지 못하는 경향도 갖추고 있습니다."
  },
  {
    iljuString: "경진",
    name: "경진(庚辰)",
    image: "/imgs/경진.png",
    hashtags: "#두뇌회전 #자기주장 #판단력 #재주",
    description: "경진일주는 두뇌회전이 빠르고, 심신이 강건하며 인내심이 있습니다. 자기 주장이 강하고, 판단력이 뛰어나며, 끼와 재주가 탁월합니다. \n하지만 고집 때문에 주변과 부딪히는 경우가 많으며, 유연성이 필요하다는 것을 기억해야 합니다."
  },
  {
    iljuString: "신사",
    name: "신사(辛巳)",
    image: "/imgs/신사.png",
    hashtags: "#변화추구 #완벽주의 #예민성향 #결과중시",
    description: "신사일주는 변화와 완벽주의를 추구하면서도 예민한 성향과 강한 주관을 가집니다. \n대인관계에서는 충돌이 잦으나, 좋아하는 사람에게는 무조건적인 희생을 아끼지 않는 모습을 보이기도 합니다. 결과를 중시하며, 끈질기게 목표를 향해 나아가는 성향이 돋보입니다."
  },
  {
    iljuString: "임오",
    name: "임오(壬午)",
    image: "/imgs/임오.png",
    hashtags: "#부드러움 #민첩성 #새로운질서 #극단적힘",
    description: "임오일주는 부드러운 성격과 섬세함을 가지지만, 동시에 민감하고 극단적인 기운을 지녔습니다. 그들은 손과 생각이 민첩하며, 특유의 지혜와 눈치가 빠르며, 위기 대처 능력이 뛰어납니다. \n임오일주는 새로운 질서와 변화를 추구하면서도 극단적인 힘을 동시에 지니고 있어, 그들의 삶은 흥미롭지만 도전적일 수 있습니다."
  },
  {
    iljuString: "계미",
    name: "계미(癸未)",
    image: "/imgs/계미.png",
    hashtags: "#부드러움 #원만 #행복철학 #추진력",
    description: "계미일주의 사람들은 부드럽고 맑은 성격을 지니며 대인관계에서 원만하게 행동합니다. 그들은 자신만의 행복 철학이 있으며, 아무려면 어떤 어려운 환경에서도 삶의 희망을 잃지 않습니다. \n그러나 시작하기가 어려울 때가 있어도 한번 시작하면 그들의 추진력은 탱크처럼 강력합니다."
  },
  {
    iljuString: "갑신",
    name: "갑신(甲申)",
    image: "/imgs/갑신.png",
    hashtags: "#리더십 #사회적활동 #개혁 #인생굴곡",
    description: "갑신일주는 그릇이 크고 고상한 이상을 품으며, 정당하고 바른길을 추구합니다. 갑신일주는 강한 리더십과 개혁의 의지를 가지며, 사회적 활동을 왕성하게 합니다. \n그러나 많은 인생의 굴곡과 에너지의 소모를 경험하며, 큰 재물을 모으기 어려운 경향이 있습니다."
  },
  {
    iljuString: "을유",
    name: "을유(乙酉)",
    image: "/imgs/을유.png",
    hashtags: "#강인함 #예술적감각 #명석 #성공주의",
    description: "을유일주는 겉으로 부드러워 보이지만, 실제로는 강인하고 강한 생존 능력을 지녔습니다. 이 일주의 두뇌는 명석하며, 개성이 강하고 예술적 감각이 탁월합니다. \n그러나 성공 후에는 권력을 즐기는 경향이 있어 주의가 필요합니다."
  },
  {
    iljuString: "병술",
    name: "병술(丙戌)",
    image: "/imgs/병술.png",
    hashtags: "#단정함 #외로움 #고독 #학문",
    description: "병술일주는 세속적인 성공, 재물, 그리고 명예와 연관되어 있습니다. 본인들은 아픔을 안고 있지만 속정이 깊으며, 단정한 특징을 지니고 있습니다. \n반면 외로움과 고독도 느끼는 특징을 가지고 있으며, 학문이나 예술에 뛰어난 재능을 지녔습니다."
  },
  {
    iljuString: "정해",
    name: "정해(丁亥)",
    image: "/imgs/정해.png",
    hashtags: "#온순함 #보호능력 #평탄한삶 #처세력",
    description: "정해일주는 온순하고 착실하며 주변의 칭찬을 많이 받지만, 변덕스럽게 행동하여 주변을 힘들게 할 때도 있습니다. 그는 어려운 상황에서도 자신을 보호하는 능력이 있으며, 평생 무난하고 평탄한 삶을 이루게 됩니다. \n그러나 일찍 지치는 경향이 있으며, 처세가 뛰어나기 때문에 주변의 시샘을 받을 수 있습니다."
  },
  {
    iljuString: "무자",
    name: "무자(戊子)",
    image: "/imgs/무자.png",
    hashtags: "#신중 #합리성 #중도적 #균형",
    description: "무자일주는 말과 행동이 신중하며, 정재적인 성향이 강합니다. 주요 특징으로는 신중함과 합리성을 중시하며, 중도적인 성향을 가지고 있습니다. \n그러나 무자일주는 자신의 균형을 잘 지키지 못하면 큰 손실을 입을 수 있습니다."
  },
  {
    iljuString: "기축",
    name: "기축(己丑)",
    image: "/imgs/기축.png",
    hashtags: "#성실함 #끈기 #정신건강 #긍정태도",
    description: "기축일주는 꼼꼼하고 성실한 성향을 지녔으며, 어떤 일을 하더라도 그것을 극복해 내려는 끈기를 보입니다. 그러나 습한 기운으로 인해 정신적 건강에 유의해야 하며, 긍정적으로 인생을 이끌어 나가는 것이 중요합니다. 이 사람들은 근면과 성실함으로 인해 어려움을 극복하며 조금씩 열심히 해 성공하는 경향이 있습니다."
  },
  {
    iljuString: "경인",
    name: "경인(庚寅)",
    image: "/imgs/경인.png",
    hashtags: "#활동성 #긍정성 #개척력 #강한기운",
    description: "경인일주는 재물복과 성공운이 있으며, 활동적이고 긍정적인 성향을 가지고 있습니다. 그러나 관심이 없는 일이나 명예와 돈과 관련이 없는 일에는 적극성을 보이지 않으며, 결정적인 순간에 맺고 끊는 힘이 약하다는 특징이 있습니다. \n또한, 경인일주는 개척력과 조직에 대한 큰 공헌과 이익을 가지며, 강한 기운을 지니고 있습니다."
  },
  {
    iljuString: "신묘",
    name: "신묘(辛卯)",
    image: "/imgs/신묘.png",
    hashtags: "#재능 #꼼꼼 #의심 #성공",
    description: "신묘일주는 재능이 뛰어나며, 꼼꼼하고 알뜰한 성격을 가지고 있습니다. \n그러나 그들의 꼼꼼한 성격으로 인해 의심이 많아, 때로는 분쟁을 일으키기도 합니다. 하지만 그들이 차근차근 전진하면, 그 태도가 결국 성공과 부를 가져다 줍니다."
  },
  {
    iljuString: "임진",
    name: "임진(壬辰)",
    image: "/imgs/임진.png",
    hashtags: "#섬세꼼꼼 #주의깊음 #신뢰받음 #멀티태스킹",
    description: "임진 태생의 사람들은 섬세하고, 꼼꼼한 성격을 지녔습니다. 그들은 세세한 부분까지 주의 깊게 살펴보며, 놓치지 않는 성격이 많은 사람들에게 신뢰를 줍니다. \n하지만 지나치게 꼼꼼한 탓에 때로는 큰 그림을 놓칠 수 있습니다."
  },
  {
    iljuString: "계사",
    name: "계사(癸巳)",
    image: "/imgs/계사.png",
    hashtags: "#계획성 #완벽주의 #추진력 #활동력",
    description: "계사일주는 사회에서 활발하게 활동하며, 원칙과 계획을 바탕으로 움직입니다. 하지만 그들의 완벽주의 성향으로 인해 결정을 내리는데 시간이 많이 소요됩니다. \n이들은 높은 추진력과 활동력을 바탕으로 조직에서 빠른 승진을 하는 경향이 있습니다."
  },
  {
    iljuString: "갑오",
    name: "갑오(甲午)",
    image: "/imgs/갑오.png",
    hashtags: "#명랑 #화려함 #강렬한인상 #말능숙",
    description: "갑오일주는 활발하고 명랑한 성향과 공허하고 쓸쓸한 성향을 동시에 지닙니다. 화려한 겉모습 아래 내적인 만족이나 결실이 약할 수 있으나, 그들은 강렬한 인상을 남기며 매력적이고 독특한 스타일을 지녔습니다. \n말을 능숙하게 하는 반면, 말로 인한 위험도 있어 항상 조심스러운 태도를 가져야 합니다."
  },
  {
    iljuString: "을미",
    name: "을미(乙未)",
    image: "/imgs/을미.png",
    hashtags: "#부드러운성품 #적응력 #침착한대처",
    description: "을미일주의 특성은 완연한 봄의 명랑함과 만물의 생동 및 결실에 연관되어 재물과 깊은 관련이 있습니다. 성품이 부드럽고 적응력이 뛰어나나, 표현 방식이 소극적이어서 주관이 부족하고 타인에게 오해를 받기 쉽습니다. \n그러나 매사에 환경적응이 높아 어려운 상황도 침착하게 대처할 능력을 가지고 있습니다."
  },
  {
    iljuString: "병신",
    name: "병신(丙申)",
    image: "/imgs/병신.png",
    hashtags: "#재주 #활동성 #사리분별 #다재다능",
    description: "병신일주는 활동적이고 재주가 많은 성격을 가지고 있으며, 성격은 원만하면서도 사리분별이 좋아 사회생활에 잘 어울립니다. 그러나 과도한 활동성으로 인한 불안정함과 질병이나 사고에 취약한 경향이 있습니다. \n또한, 지적인 관심과 재주를 가지고 있어 두뇌가 총명하며 매사에 다재다능의 능력을 발휘합니다."
  },
  {
    iljuString: "정유",
    name: "정유(丁酉)",
    image: "/imgs/정유.png",
    hashtags: "#순수 #명석두뇌 #다재다능 #고집",
    description: "정유일주는 전체적으로 조화로운 성향과 발전을 보이며, 맑고 순수한 기운으로 타인에게 사랑을 받는 특징이 있습니다. 그러나 순수한 성향을 오남용하면 부정적인 결과를 초래할 수 있으며, 고집이 세고 화를 잘 내는 성격도 갖추고 있습니다. \n또한, 재능과 명석한 두뇌를 가지고 있어 여러 분야에서 활약할 수 있는 능력을 가지고 있습니다."
  },
  {
    iljuString: "무술",
    name: "무술(戊戌)",
    image: "/imgs/무술.png",
    hashtags: "#명예 #자존심 #독특성향 #강한힘",
    description: "무술일주는 자신만의 믿음을 가지며 융통성이 떨어지지만 명예와 자존심을 중시합니다. 자존심은 그들에게 굉장히 중요하며, 그들의 강한 힘은 일상적이지 않은 독특한 사고를 가져다줍니다. \n무술일주는 세상의 거친 요소들을 극복하는 능력이 있으며, 그들의 힘은 항상 숨겨져 있지만 크게 표출될 때 강력합니다."
  },
  {
    iljuString: "기해",
    name: "기해(己亥)",
    image: "/imgs/기해.png",
    hashtags: "#안정성 #잠재력 #정신건강 #끈기",
    description: "기해일주는 소극적이면서도 은근한 끈기와 정직함으로 많은 사람들에게 인정받는 성품을 가지고 있습니다. 반듯하게 행동하려는 기해일주는 재물에 대한 안정성이 높고, 주변 사람들에게는 알다가도 모를 성향과 깊은 잠재력을 갖고 있습니다. \n그러나 내면의 감정 발산이 부족하므로 정신적인 부분에서 어려움을 겪을 수 있습니다."
  },
  {
    iljuString: "경자",
    name: "경자(庚子)",
    image: "/imgs/경자.png",
    hashtags: "#총명함 #표현력 #집요함 #고독감",
    description: "경자일주는 뛰어난 재주와 총명함을 지녔으며, 특히 언어 능력과 표현력이 뛰어납니다. 하지만 자존심이 강해 자신의 주장을 굽히기 어려운 편이며, 하나에 꽂히면 그것을 끝까지 추구하는 성향이 있습니다. \n또한, 깨끗한 마음을 유지하려는 경향이 있어 외부와의 관계에서 고독을 느끼기도 합니다."
  },
  {
    iljuString: "신축",
    name: "신축(辛丑)",
    image: "/imgs/신축.png",
    hashtags: "#지혜 #성실 #냉정 #종교관심",
    description: "신축일주는 지혜와 정밀한 손재주를 가진 사람들이 많으며, 주체성이 강하고, 근면하고 성실한 성격의 소유자입니다. \n그러나 노력에 비해 보상이 적어서 좌절감을 느낄 수 있고, 자존심이 상할 경우 뒤끝이 깁니다. 냉정하고 깨끗한 인상을 가지며, 종교나 철학에 대한 관심이 깊습니다."
  },
  {
    iljuString: "임인",
    name: "임인(壬寅)",
    image: "/imgs/임인.png",
    hashtags: "#융통성 #박력 #학문 #지혜",
    description: "임인일주는 융통성과 느긋함을 갖추면서도 박력이 있어, 생명의 물로 만물을 길러낸다는 기운을 지녔습니다. \n사회적 활동에서는 자신의 위치에서 점점 더 큰 사회로 나아가며 역할을 수행하며, 학문과 지혜에 뛰어나 지혜롭게 문제를 해결하며 자존심을 유지합니다."
  },
  {
    iljuString: "계묘",
    name: "계묘(癸卯)",
    image: "/imgs/계묘.png",
    hashtags: "#인복 #은근한고집 #자기의심 #일처리능력",
    description: "계묘일주는 인복이 많고 다른 사람들에게 도움을 주며 긍정적인 요소들을 많이 갖추고 있지만, 스스로를 의심하거나 저평가하는 경향이 있습니다. \n또한, 의외로 은근한 고집이 있어서 투자나 인간관계에서 발을 빼야 할 때에도 그렇게 하지 않는 경향이 있습니다. 그러나 일 처리 능력이 뛰어나며, 주어진 일을 즐기면서 잘 처리합니다."
  },
  {
    iljuString: "갑진",
    name: "갑진(甲辰)",
    image: "/imgs/갑진.png",
    hashtags: "#명예심 #추진력 #사회활동 #빠른결정",
    description: "갑진일주는 봄의 에너지와 생동감을 갖고 있어, 원만하게 세상을 살아가는 사람들이 많습니다. 이 에너지로 인해 강한 추진력과 사회 활동성을 발휘하지만, 때로는 지나친 명예심으로 인한 고민을 겪을 수 있습니다. \n도움을 받을 때보다 혼자 힘을 믿고 상황을 극복하는 능력이 뛰어나며, 성공과 실패 모두를 빠르게 경험합니다."
  },
  {
    iljuString: "을사",
    name: "을사(乙巳)",
    image: "/imgs/을사.png",
    hashtags: "#명랑함 #자기표현 #상관의힘 #두뇌회전",
    description: "을사일주는 밝고 명랑한 성격을 지니며, 자기 표현에 능하고 두뇌회전이 빠른 특성을 가집니다. 상관의 힘으로 유능하고 치밀하며 사회적 교섭 능력과 풍부한 상상력 및 세심한 집행력이 동시에 있습니다. \n그러나 지나친 자기 표현 때문에 오해나 고통을 겪을 수 있으며, 을사일주 특유의 표현력이 정신적 고통이 되는 경우도 있습니다."
  },
  {
    iljuString: "병오",
    name: "병오(丙午)",
    image: "/imgs/병오.png",
    hashtags: "#강력한기 #극단적성향 #빠른판단력",
    description: "병오일주는 강력한 기를 지니며, 성취와 실패 사이의 극단적인 특성을 가지고 있습니다. 그들은 빠르고 정교한 판단력을 갖추었지만, 빠른 판단 때문에 손해를 입는 경우도 있습니다. \n또한, 병오일주는 속상함이나 불만을 잘 잊고, 큰 변화나 어려움에도 부딪혀 나가는 인성을 지니고 있습니다."
  },
  {
    iljuString: "정미",
    name: "정미(丁未)",
    image: "/imgs/정미.png",
    hashtags: "#성실함 #명랑함 #결단력 #융통성",
    description: "정미일주는 성실하고 안정적인 성향을 가진 사람이지만 때로는 융통성이 부족하게 느껴질 수 있습니다. 그러나 그들은 어려운 환경에서도 명랑하게 버텨나가며, 어려움을 겪으면서 성장하는 성향이 있습니다. \n주변에서는 그들의 온화하고 착한 성향을 높이 평가하며, 그들이 한번 결정하면 끝까지 밀어붙이는 단호한 성격을 가지고 있다는 것을 알고 있습니다."
  },
  {
    iljuString: "무신",
    name: "무신(戊申)",
    image: "/imgs/무신.png",
    hashtags: "#카리스마 #낙천적 #의지박약 #독립성",
    description: "무신일주의 사람들은 카리스마 있고, 낙천적인 성향을 가지며 섬세하고 예민한 관찰력을 갖추고 있습니다. 그러나 의지박약과 게으름의 특징도 있으며, 다양한 관심사로 인해 쉽게 포기하는 경향이 있습니다. \n또한, 무신일주는 변화를 추구하고 일반적인 경로나 충고를 따르기를 꺼려하며, 자신만의 방식으로 일을 처리하는 경향이 있습니다."
  },
  {
    iljuString: "기유",
    name: "기유(己酉)",
    image: "/imgs/기유.png",
    hashtags: "#탐구심 #신뢰와신임 #교육능력 #예민성향",
    description: "기유일주는 탐구심이 강하고 조직에서 신뢰와 신임을 잘 받는 성향을 가지고 있습니다. 현실적인 성향으로 자신의 것을 잘 챙기며, 교육 분야에서 큰 힘을 발휘하는 일주입니다. \n그러나 예민하고 까칠한 경향도 가지고 있어 대중 앞에서는 날카로운 모습이 드러날 수 있습니다."
  },
  {
    iljuString: "경술",
    name: "경술(庚戌)",
    image: "/imgs/경술.png",
    hashtags: "#자기주관 #재능 #직관력 #강인함",
    description: "경술일주의 기본 성향은 자기 주관이 확고하고 예체능에 재능이 있어 자신감이 넘치며, 섬세하고 치밀한 시각과 판단력을 지녔습니다. 그러나 종종 남의 의견을 무시하는 경향이 있어 반감을 사기도 하지만, 직관력이 뛰어나 천부적인 감각의 왕이라고 볼 수 있습니다. \n경술일주의 특징 중 하나는 강한 힘을 지녀, 그 힘을 사용해 남을 도와야 인생이 평화로울 것이라는 믿음을 갖고 있습니다."
  },
  {
    iljuString: "신해",
    name: "신해(辛亥)",
    image: "/imgs/신해.png",
    hashtags: "#재능 #천재성 #사리분별력 #대인관계",
    description: "신해일주의 천성은 선량하며 재능이 풍부하나, 종종 타인과 갈등을 겪을 수 있습니다. 이들은 자신의 관심 분야에서 천재적 능력을 발휘하며, 동시에 사리 분별력이 뛰어나고 조직을 잘 정리하는 경향이 있습니다. \n그러나 너무 자신의 논리에 집착하다 보니 대인관계에서는 원만하지 못하며, 고독한 성격의 소유자가 많습니다"
  },
  {
    iljuString: "임자",
    name: "임자(壬子)",
    image: "/imgs/임자.png",
    hashtags: "#의욕적 #끈기 #통솔력 #눈치빠름",
    description: "임자일주의 사람들은 의욕적이며 진취적인 기질을 가지고 있지만, 화를 내기 쉬운 경향이 있습니다. 그들은 굉장한 두뇌와 통솔력을 지녔으며, 끈기와 인내심이 특징입니다. \n또한, 임자일주의 사람들은 매우 눈치가 빠르며 상대방의 마음을 잘 읽을 수 있습니다."
  },
  {
    iljuString: "계축",
    name: "계축(癸丑)",
    image: "/imgs/계축.png",
    hashtags: "#자존심 #추진력 #인정욕구 #명예심",
    description: "계축일주의 성격은 믿음직스러운데, 시작은 느리나 일단 시작하면 결과를 꼭 이룹니다. 목표와 인정을 중요하게 생각하며, 행동이 느려도 인정을 받을 때만큼은 활기를 발휘합니다. \n계축일주는 겉모습보다 내면에 강한 추진력과 자존심을 가지며, 지나치게 깨끗하게 일처리나 사람 관계를 정리하는 경향이 있습니다."
  },
  {
    iljuString: "갑인",
    name: "갑인(甲寅)",
    image: "/imgs/갑인.png",
    hashtags: "#명랑 #자존심강함 #삶의변동성 #예술능력",
    description: "갑인일주는 밝고 명랑하며 자존심이 강하고 능동적입니다. 그러나 자신의 강력한 성격으로 주변과의 마찰이 잦으며, 삶의 변동성이 크고 성취를 좋아합니다. \n이 일주의 기운은 나무의 탐구심과 호기심에서 비롯되며, 학문이나 예술 분야에서 탁월한 능력을 발휘합니다."
  },
  {
    iljuString: "을묘",
    name: "을묘(乙卯)",
    image: "/imgs/을묘.png",
    hashtags: "#유연성 #절제력 #상상력 #창조력",
    description: "을묘일주는 유연하고 촉촉한 성향을 가진 사람들로, 그들의 절제력과 센스가 뛰어나며 대인관계를 원만하게 유지하려고 합니다. \n기본적으로 연약하고 부드러운 성향을 가지고 있지만, 자신의 주관이 분명하며 남에게 강요하지 않습니다. 그들은 상상력이 풍부하며 창조적인 요소를 가지고 있어, 예술적인 성향이 강합니다."
  },
  {
    iljuString: "병진",
    name: "병진(丙辰)",
    image: "/imgs/병진.png",
    hashtags: "#밝은에너지 #원만한인간관계 #선견지명",
    description: "병진일주는 밝고 긍정적인 에너지로 가득 차 있으며, 명랑하고 자비로운 성향을 가지고 있습니다. 또한 인간관계에서 중후하고 원만하게 행동하며, 선견지명과 예민한 감수성을 지녔습니다. \n병진일주는 조직에서는 시간이 지나면 좋은 평가를 받는 경향이 있으며, 자신의 이상을 숨기는 경향이 강합니다."
  },
  {
    iljuString: "정사",
    name: "정사(丁巳)",
    image: "/imgs/정사.png",
    hashtags: "#강한의지 #권력추구 #신념중시 #기억력",
    description: "정사일주는 강한 의지와 활동성을 가진 사람이지만 지나치게 자기 중심적이어서 남과의 관계에서 융화가 어렵습니다. \n권력과 실리를 중요하게 생각하며, 자신의 신념과 정의로움을 중시합니다. 그러나 기억력이 좋아 오래전의 좋은 일도 기억하여 돌려주는 성향이 있습니다."
  },
  {
    iljuString: "무오",
    name: "무오(戊午)",
    image: "/imgs/무오.png",
    hashtags: "#만물포용 #인내노력 #갈증인생 #기분변화",
    description: "무오일주는 만물을 생산하고 포용하는 강력한 힘을 지니지만, 뜨거운 기운이 제어되지 않으면 인생에 갈증을 느낍니다. 일지의 특성으로 인해 무오일주는 인내와 노력으로 성공을 이루나, 동시에 고통과 함께하는 경향이 있습니다. \n무오일주의 주변인들은 그들의 현재 상태와 기분 변화에 주의해야 합니다."
  },
  {
    iljuString: "기미",
    name: "기미(己未)",
    image: "/imgs/기미.png",
    hashtags: "#뚝심 #명예욕 #자존심 #사교성",
    description: "기미일주는 꾸준한 뚝심과 승부욕을 지녔으며 명예와 자존심에 대한 강렬한 욕구가 있습니다. 그러나 자신의 영역과 가족을 중심으로 생각하며, 다른 모습을 겉과 안에서 다르게 보이는 경향이 있습니다. \n이들은 겉으로는 사교적인 모습을 보이지만 속으로는 보수적이며 폐쇄적인 성격을 가지고 있습니다."
  },
  {
    iljuString: "경신",
    name: "경신(庚申)",
    image: "/imgs/경신.png",
    hashtags: "#카리스마 #자기확신 #명예중시 #승부욕",
    description: "경신일주는 주관이 뚜렷하며 경쟁과 승부욕이 강한 성향을 지녔습니다. \n이들은 강한 자기 확신과 카리스마를 가지고 있지만, 고집이 강해 때로는 자신만의 세계에 갇힐 위험이 있습니다. 또한 명예를 중시하며, 그로 인한 승부근성이 매우 강한 특징을 지녔습니다."
  },
  {
    iljuString: "신유",
    name: "신유(辛酉)",
    image: "/imgs/신유.png",
    hashtags: "#정의로움 #프로의식 #예술적자질",
    description: "신유일주는 예술적 자질과 기술적 장인정신이 뛰어나지만 자존심이 강하여 인간관계에서 갈등을 겪을 때가 많습니다. 판단력은 예리하며 세밀한 직관력을 갖췄지만, 그 예리함 때문에 사소한 일에도 예민하게 반응하며, 자부심과 주관이 확고합니다. \n그러나 정의롭고 정직한 기질을 갖추고 있으며, 프로의식이 높아 어떤 직업에서도 전문성을 발휘합니다."
  },
  {
    iljuString: "임술",
    name: "임술(壬戌)",
    image: "/imgs/임술.png",
    hashtags: "#온화 #재물능력 #대인관계 #직관적",
    description: "임술일주는 온화하고 쾌활한 성격을 가졌으며, 재물에 관한 능력이 뛰어납니다. 대인관계 능력이 탁월하며, 육감과 직관 또한 매우 높습니다. \n그러나 자신의 판단을 과도하게 믿어 큰 손실을 겪을 수 있으며, 고난 앞에서도 긍정적인 태도를 유지합니다."
  },
  {
    iljuString: "계해",
    name: "계해(癸亥)",
    image: "/imgs/계해.png",
    hashtags: "#신비감 #머리회전 #과시욕 #글로벌사고",
    description: "계해일주는 뚜렷한 신비감과 머리 회전으로 사건을 해결하는 능력을 지니고 있지만, 동시에 고독과 외로움을 느낍니다. 그들은 말을 할 때 가장 중요한 것을 표현하며, 뛰어난 머리로 어려운 상황도 잘 극복합니다. \n그러나 과시욕이 있어 때때로 사회적 고립을 경험할 수 있으며, 해외와의 연관성이 깊어 글로벌한 사고 방식을 가집니다."
  },
];